app/views/projects/_add_user_to_project.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]
---
<div class="add-user-form-container">
	<% if current_user.has_role? :admin, Project.find_by(id: params[:id])%>