app/controllers/building_sheets_controller.rb

  def new
    @user_id = current_user.id
    @project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]

  def create
    @project = Project.find_by(id: params[:project_id])
    @building_sheet = BuildingSheet.new(permitted_params)
    if @building_sheet.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "building_sheets" ("description", "substructure", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "dtyn"], ["substructure", "dtyn"], ["created_at", "2016-03-18 15:56:09.593507"], ["updated_at", "2016-03-18 15:56:09.593507"]]