app/controllers/context_sheets_controller.rb

  def new
    @user_id = current_user.id
    @project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]

  def create
    @project = Project.find_by(id: params[:project_id])
    @context_sheet = ContextSheet.new(permitted_params)
    if @context_sheet.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "context_sheets" ("description", "context_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "dcd"], ["context_type", "dcd"], ["created_at", "2016-03-23 12:03:01.826387"], ["updated_at", "2016-03-23 12:03:01.826387"]]
INSERT INTO "contexts" ("interpretation", "ue", "discussion", "site_code", "area", "recorded_by", "below", "above", "section", "trench", "project_id", "contextable_type", "contextable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"