app/controllers/contexts_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]
SELECT  "contexts".* FROM "contexts" WHERE "contexts"."id" = $1 LIMIT 1  [["id", 44]]
---
  def show
    @project = Project.find_by(id: params[:project_id])
    @context = Context.find_by(id: params[:id])