app/controllers/masonry_sheets_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]
---
  def new
    @user_id = current_user.id
    @project = Project.find_by(id: params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "masonry_sheets" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", ""], ["created_at", "2016-03-18 17:15:32.107126"], ["updated_at", "2016-03-18 17:15:32.107126"]]
---
  def create
    @project = Project.find_by(id: params[:project_id])
    @masonry_sheet = MasonrySheet.new(permitted_params)
    if @masonry_sheet.save