app/controllers/projects_controller.rb

SELECT "users".* FROM "users"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @users = User.all
    @project = Project.find_by(id: params[:id])

INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = current_user
    @project = @user.projects.new(project_params)
    binding.pry
    if @project.save!

SELECT "projects".* FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = $1  [["user_id", 5]]
---
  def index
    @projects = current_user.projects.all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "perico@mail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT  1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = $1 AND "users"."id" = $2 LIMIT 1  [["project_id", 18], ["id", 4]]
---
 def add_user_to_project
    @project = Project.find_by(id: params[:id])
    new_user = User.find_by(email: params[:new_user])
    if @project.users.include? new_user