app/controllers/records_controller.rb

SELECT "contexts".* FROM "contexts" WHERE "contexts"."project_id" = $1  [["project_id", 18]]
---
  def index
    @project = Project.find_by(id: params[:project_id])
    @records_index = @project.contexts.all