app/controllers/records_controller.rb

  def create
    @project = Project.find_by(id: params[:project_id])
    @context = @project.contexts.create(context_params)
    if @context.save
      @skeleton_sheet = SkeletonSheet.create(skeleton_params)
      if @context.context_types.create(contextable: @skeleton_sheet)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "contexts" ("site_code", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["site_code", "veargaerg"], ["project_id", 12], ["created_at", "2016-03-18 13:44:47.394791"], ["updated_at", "2016-03-18 13:44:47.394791"]]
INSERT INTO "skeleton_sheets" ("grave_cut", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["grave_cut", "tgg"], ["created_at", "2016-03-18 13:50:05.303616"], ["updated_at", "2016-03-18 13:50:05.303616"]]
INSERT INTO "context_types" ("contextable_id", "contextable_type", "context_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contextable_id", 11], ["contextable_type", "SkeletonSheet"], ["context_id", 19], ["created_at", "2016-03-18 13:23:50.165538"], ["updated_at", "2016-03-18 13:23:50.165538"]]

  def index
    @user_id = params[:user_id]
    @project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 8]]