app/controllers/skeleton_sheets_controller.rb

  def new
    @user_id = current_user.id
    @project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]

  def create
    @project = Project.find_by(id: params[:project_id])
    @skeleton_sheet = SkeletonSheet.new(permitted_params)
    if @skeleton_sheet.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 14]]
INSERT INTO "skeleton_sheets" ("grave_type", "grave_cut", "grave_fill", "coffin", "orientation", "group", "burial_number", "provisional_period", "skeleton_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"