app/controllers/timber_sheets_controller.rb

  def new
    @user_id = current_user.id
    @project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 18]]

  def create
    @project = Project.find_by(id: params[:project_id])
    @timber_sheet = TimberSheet.new(permitted_params)
    if @timber_sheet.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "timber_sheets" ("description", "species", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "gertgr"], ["species", "gwrtgwrt"], ["created_at", "2016-03-18 17:19:46.483734"], ["updated_at", "2016-03-18 17:19:46.483734"]]