app/views/layouts/_navBar.html.erb

<% if current_user %>
  <% if current_user.has_role? :admin, Project.find_by(id: params[:id])%>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 5]]