app/views/layouts/_project.html.erb

<div>
  <%  @project = Project.find_by(id: params[:project_id]) # esto va en el/los controladores. %>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" IS NULL LIMIT 1